{
  "Navigation": {
    "home": "Home",
    "about": "About",
    "skills": "Skills",
    "projects": "Projects",
    "contact": "Contact",
    "lang": {
      "select": "Select",
      "selected": "EN",
      "label": "Languages"
    }
  },
  "Home": {
    "greetings": "Hi, my name is",
    "my_name": "Otávio",
    "job_position": "Fullstack Developer",
    "presentation": "I primarily work with Next.js and Golang, alongside Docker and PostgreSQL, building scalable, high-performance web applications. I have a strong interest in Software Architecture and continuously study advanced concepts such as MVC, layered architecture, Monoliths, and Microservices, including the migration of Monolithic systems to Microservices.",
    "projects": {
      "title": "Projects"
    },
    "skills": {
      "title": "Skills",
      "first_desc": [
        {
          "text": "This project leverages these technologies, which are central to my daily work. I apply them in both professional and personal projects, always focusing on best practices, scalability, and development quality."
        },
        {
          "text": "These technologies also reflect my commitment to delivering modern, high-performance solutions that meet the real needs of each project."
        }
      ],
      "second_desc": {
        "text": "In addition to the technologies above, I have experience with other tools and frameworks. They are organized by category and can be explored in the skill cards."
      }
    }
  },
  "Experience": {
    "title": "Experience",
    "experiences": [
      {
        "company": "ASTRA S/A",
        "roles": [
          {
            "job_title": "Fullstack Developer",
            "period": "Jun 2025 - Jan 2026",
            "desc": "Developed web applications using Go, React, PostgreSQL, and Docker. Designed and implemented REST APIs and system integrations. Delivered scalable, high-performance solutions while applying best practices in software architecture and DevOps."
          },
          {
            "job_title": "Systems Development Intern",
            "period": "Jan 2025 - May 2025",
            "desc": "Built web interfaces using HTML, CSS, and JavaScript. Created workflows and forms in TOTVS Fluig. Integrated REST APIs and automated internal processes to improve efficiency."
          }
        ]
      }
    ]
  },
  "Projects": {
    "portfolio": {
      "title": "Portfolio",
      "desc": "Portfolio project - Built with Next.js, TypeScript, and ShadCN."
    },
    "binomial_distribution": {
      "title": "Binomial Distribution",
      "desc": "Calculator that performs binomial distribution calculations - Built with Next.js and Tailwind CSS."
    },
    "link": "View on GitHub"
  },
  "Footer": {
    "title": "Contact",
    "desc": "I'm available for questions, feedback, or collaboration opportunities. Let me know how I can help!",
    "form": {
      "first_name": {
        "label": "First Name",
        "placeholder": "John"
      },
      "last_name": {
        "label": "Last Name",
        "placeholder": "Pereira"
      },
      "email": {
        "label": "Email",
        "placeholder": "john.pereira@gmail.com"
      },
      "subject": {
        "label": "Subject",
        "placeholder": "Write the subject here"
      },
      "message": {
        "label": "Message",
        "placeholder": "And your message here :)"
      },
      "validations": {
        "first_name": {
          "min": "The first name must contain at least 3 letters.",
          "max": "The first name must contain a maximum of 50 characters."
        },
        "last_name": {
          "min": "The last name must contain at least 3 letters.",
          "max": "The last name must contain a maximum of 50 characters."
        },
        "email": "This email is not valid.",
        "subject": {
          "min": "The subject must contain at least 5 characters.",
          "max": "The subject must contain a maximum of 100 characters."
        },
        "message": {
          "min": "The message must contain at least 10 characters.",
          "max": "The message must contain a maximum of 100 characters."
        }
      },
      "success": "Email sent successfully! We’ll get back to you soon.",
      "error": "An error occurred while sending the email. Please try again later.",
      "send_email": "Send Email"
    }
  }
}
